[[
    "Sentiment:",
    "negative",
    "| Score:",
    0.897304892539978
],
"of course there free of all murder charges, largest criminal organization in American history. \"police\"",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.8593971133232117
],
"I can’t even imagine the panic he felt",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.8487699627876282
],
"As a ex co… they DID NOT do that correctly… the guy holding his head back has his hands on his neck",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.5785601139068604
],
"So what are they supposed to do with them let him keep running his head into the door and everything and how are they supposed to restrain them?",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.7607704401016235
],
"It’s funny…there have been millions of people in custody all across this country that have not fought the police and live to tell about it",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.7352210879325867
],
"Dang thats crazy. Hope the officers are okay",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.9150635600090027
],
"The American justice system needs reform 💯😡",
[
    "Sentiment:",
    "neutral",
    "| Score:",
    0.781644880771637
],
"Not the first for Montgomery county",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.4966849088668823
],
"A barber needs 6 months to cut your hair, and a police officer needs 3 months to unalive someone.",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.9081717133522034
],
"If you agree with their actions remember that your tax money will pay for their vacations and for the pain and suffering of his family. Something HAS to change!",
[
    "Sentiment:",
    "positive",
    "| Score:",
    0.6992306709289551
],
"Wow",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.789249837398529
],
"I've been in this position before. Even if he's alone in the cell he could fatally injure himself banging his head so after a while they have to use a restraint chair which is usually last resort because it can only be used for a short period of time and requires lots of shirt paperwork. So to get to this point he was warned and had to be in the restraint chair but the way they handled him was improper and excessive force. They bent him in half until he couldn't breathe and you can see they didn't believe he was unconscious at first and acted slowly. So by trying to keep him safe from himself, the killed him. I'm so so sorry to the family 🥺 so so sad.",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.838303804397583
],
"That sucks",
[
    "Sentiment:",
    "positive",
    "| Score:",
    0.8658485412597656
],
"Glad the officers are okay!",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.8550173044204712
],
"I can’t imagine trying to be a cop in this day and age.",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.6434577703475952
],
"He’s fighting the police WTH 🤔",
[
    "Sentiment:",
    "neutral",
    "| Score:",
    0.5753430128097534
],
"I just saw that cpr machine on The Pitt, didn’t think it was real",
[
    "Sentiment:",
    "neutral",
    "| Score:",
    0.8791986703872681
],
"What did the autopsy say?",
[
    "Sentiment:",
    "negative",
    "| Score:",
    0.621616542339325
],
"Ohh no",
[
    "Sentiment:",
    "positive",
    "| Score:",
    0.8994691967964172
],
"only leader of the world Imran Khan Pakistan"