 Israeli Prime Minister Benjamin Netanyahu faces one of the most high-risk moments of his political career, a vote that would dissolve Israel's parliament and collapse his government after more than 600 days of war. The question is, why now? Well, let's remind you of the political climate here. Netanyahu has begun testifying and is ongoing corruption trial years after pleading not guilty. There's also various large-scale protests at home and an arrest war for the international criminal court on allegations of war crimes which Netanyahu has rejected. Then of course there's the fraught relationship with President Donald Trump after the US made a series of moves in the region without crucially looping in Israel. That includes Iran negotiations moves on Syria as well as a ceasefire deal with the hooffee's. But that's not why the government could collapse now. Here it's all about friction between Netanyahu and his little coup party and the ultra-orthodox religious parties. Those parties are looking for a broad exemption for ultra-orthodox men from Israel's mandatory military draft something they traditionally had for decades. But now Israel is more than 20 months into a war in Gaza and the military needs more men. Much of the country sees it as a question of fair burden sharing between the different parts of Israeli society. But it's on this issue that some of the major religious parties are threatening to vote against Netanyahu and collapse the government. What would happen if they did? Well, crucially it would send the government to the first elections since before the war started. But it's not that simple and there's a process here that has to play out. Because the upcoming vote is only the first vote and there are at least three more that need to happen. Because Netanyahu's party controls Israel's parliament, the Knesset, they can try to drag out these votes for weeks if they want to. Even so, if the first vote passes that preliminary reading, it is a very strong signal to Netanyahu that the pressure on his government is rising.